[
  {
    "id": 1,
    "title": "Bliss",
    "location": "Arabian Ranches 3, Dubai",
    "type": "Apartment",
    "developer": "Emaar Properties",
    "price": "AED 2,850,000",
    "image": "https://mondusproperties.ae/storage/properties/bliss/b5-400x260.png",
    "beds": 3,
    "baths": 4,
    "featuresAndAmenities": [
      "Community Park",
      "Swimming Pool",
      "Children’s Play Area",
      "Retail Outlets",
      "Jogging Tracks"
    ],
    "description": "Bliss at Arabian Ranches 3 offers a harmonious blend of urban convenience and natural beauty. Designed for families, this community features modern townhouses inspired by minimalist architecture with clean lines and spacious interiors.\n\nSurrounded by lush greenery and pedestrian-friendly walkways, residents can enjoy a peaceful environment while staying connected to key city locations. With a host of amenities including parks, pools, and leisure areas, Bliss promotes a lifestyle of relaxation and community engagement."
  },
  {
    "id": 2,
    "title": "South Bay",
    "location": "Dubai South, Dubai",
    "type": "Villa",
    "developer": "Dubai South Properties",
    "price": "AED 4,699,999",
    "image": "https://mondusproperties.ae/storage/properties/south-bay/s1-400x260.png",
    "beds": 5,
    "baths": 7,
    "featuresAndAmenities": [
      "Beach Lagoon",
      "Private Gardens",
      "Clubhouse",
      "Fitness Center",
      "24/7 Security"
    ],
    "description": "South Bay is a vibrant waterfront community offering a luxurious collection of villas with private gardens and spacious interiors. It’s nestled in the heart of Dubai South, designed to offer tranquility and elegance.\n\nWith a crystal lagoon, premium lifestyle facilities, and walkable retail options, South Bay presents an exceptional living experience. It's ideal for families looking for both exclusivity and connectivity in a growing urban district."
  },
  {
    "id": 3,
    "title": "Jebel Ali Village",
    "location": "Jebel Ali, Dubai",
    "type": "Villa",
    "developer": "Nakheel",
    "price": "AED 7,200,000",
    "image": "https://mondusproperties.ae/storage/properties/jebel-ali/j1-400x260.png",
    "beds": 4,
    "baths": 5,
    "featuresAndAmenities": [
      "Gated Community",
      "Cycling Tracks",
      "Tennis Courts",
      "Retail Plaza",
      "Community Pool"
    ],
    "description": "Jebel Ali Village by Nakheel revives one of Dubai’s oldest residential areas into a contemporary villa enclave. The homes feature clean, modern designs with thoughtful layouts and premium fittings.\n\nThe community is lined with landscaped parks and outdoor spaces, perfect for active families. Its strategic location near Sheikh Zayed Road ensures easy access to Dubai Marina, JLT, and Expo City."
  },
  {
    "id": 4,
    "title": "Avonlea",
    "location": "Mina Rashid, Dubai",
    "type": "Apartment",
    "developer": "Emaar Properties",
    "price": "AED 1,950,000",
    "image": "https://mondusproperties.ae/storage/properties/avonlea/a1-400x260.png",
    "beds": 1,
    "baths": 1,
    "featuresAndAmenities": [
      "Marina Promenade",
      "Infinity Pool",
      "Waterfront Dining",
      "Yacht Club Access",
      "Fitness Centre"
    ],
    "description": "Avonlea at Mina Rashid is an exclusive waterfront development offering stylish apartments with panoramic sea views. The project is a tribute to Dubai's rich maritime heritage, blending luxury living with cultural significance.\n\nResidents enjoy direct access to the marina promenade and leisure attractions such as floating restaurants and cafes. Its prime location and high-end lifestyle features make it a top choice for young professionals and investors."
  },
  {
    "id": 5,
    "title": "The Hamilton",
    "location": "Town Square, Dubai",
    "type": "Apartment",
    "developer": "Nshama",
    "price": "AED 1,299,999",
    "image": "https://mondusproperties.ae/storage/properties/hamilton/h1-400x260.png",
    "beds": 2,
    "baths": 2,
    "featuresAndAmenities": [
      "Central Park",
      "Kids’ Play Zone",
      "Outdoor Cinema",
      "Cycling Tracks",
      "Retail Outlets"
    ],
    "description": "The Hamilton at Town Square Dubai by Nshama is a perfect blend of urban design and community living. The apartments feature open-plan layouts with modern finishes, designed to meet the needs of young families and professionals.\n\nThe community offers a rich set of amenities including retail options, outdoor activities, and entertainment hubs. It promotes a healthy and balanced lifestyle with everything you need just a short walk away."
  },
  {
    "id": 6,
    "title": "Nadine Residences",
    "location": "Al Furjan, Dubai",
    "type": "Apartment",
    "developer": "AZIZI Developments",
    "price": "AED 2,300,000",
    "image": "https://mondusproperties.ae/storage/properties/nadine-residences/n1-400x260.png",
    "beds": 3,
    "baths": 3,
    "featuresAndAmenities": [
      "Modern Gym",
      "Swimming Pool",
      "Children’s Play Area",
      "Retail on Ground Floor",
      "Basement Parking"
    ],
    "description": "Nadine Residences is a premium apartment development in Al Furjan offering elegant units with high-quality finishes. The design emphasizes functionality and comfort with bright interiors and spacious layouts.\n\nThe building features a host of lifestyle amenities and is located within walking distance to Al Furjan Metro Station. It is an ideal choice for families and investors seeking convenience, connectivity, and value in a rapidly growing district."
  }
]
